# Практична робота 02.05.24

#### 1. На основі векторів створити дата-фрейм

In [3]:
fy <- c(2010,2011,2012,2010,2011,2012,2010,2011,2012)
company <- c("Apple","Apple","Apple","Google","Google","Google","Microsoft","Microsoft","Microsoft")
revenue <- c(65225,108249,156508,29321,37905,50175,62484,69943,73723)
profit <- c(14013,25922,41733,8505,9737,10737,18760,23150,16978)

In [4]:
length(fy)
length(company)
length(revenue)
length(profit)

[1] 9

[1] 9

[1] 9

[1] 9

In [29]:
df <- data.frame(Year = fy, Company = company, Revenue = revenue, Profit = profit)

In [30]:
df

  Year Company   Revenue Profit
1 2010 Apple      65225  14013
2 2011 Apple     108249  25922
3 2012 Apple     156508  41733
4 2010 Google     29321   8505
5 2011 Google     37905   9737
6 2012 Google     50175  10737
7 2010 Microsoft  62484  18760
8 2011 Microsoft  69943  23150
9 2012 Microsoft  73723  16978

In [16]:
df[1:3,]

  Year Company Revenue Profit
1 2010 Apple    65225  14013
2 2011 Apple   108249  25922
3 2012 Apple   156508  41733

In [18]:
head(df, 3)

  Year Company Revenue Profit
1 2010 Apple    65225  14013
2 2011 Apple   108249  25922
3 2012 Apple   156508  41733

In [20]:
tail(df,3)

  Year Company   Revenue Profit
7 2010 Microsoft 62484   18760
8 2011 Microsoft 69943   23150
9 2012 Microsoft 73723   16978

In [25]:
df[c(1,3,2), ]

  Year Company Revenue Profit
1 2010 Apple    65225  14013
3 2012 Apple   156508  41733
2 2011 Apple   108249  25922

#### 2. Інформацію про назву компанії перетворити у тип factor.

In [27]:
df$Company <- as.factor(df$Company)
head(df, 2)

  Year Company Revenue Profit
1 2010 Apple    65225  14013
2 2011 Apple   108249  25922

#### 3. Перегляньте структуру сформованого набору даних (`str()`).

In [31]:
str(df)

'data.frame':	9 obs. of  4 variables:
 $ Year   : num  2010 2011 2012 2010 2011 ...
 $ Company: chr  "Apple" "Apple" "Apple" "Google" ...
 $ Revenue: num  65225 108249 156508 29321 37905 ...
 $ Profit : num  14013 25922 41733 8505 9737 ...

#### 4. Відсортуйте дані за роками.

In [39]:
df <- df[order(df$Year),]
head(df,3)

  Year Company   Revenue Profit
1 2010 Apple     65225   14013
4 2010 Google    29321    8505
7 2010 Microsoft 62484   18760

#### 5. Додайте інформацію про маржу (margin) до набору даних ((profit / revenue) * 100).

In [41]:
df$Margin <- 100*(df$Profit/df$Revenue) 
head(df, 3)

  Year Company   Revenue Profit Margin
1 2010 Apple     65225   14013  21.48409
4 2010 Google    29321    8505  29.00651
7 2010 Microsoft 62484   18760  30.02369

### 7*. Розділити дані за роками та знайти середні значення прибуктів по роках

In [46]:
df[df$Year == 2012,]

  Year Company   Revenue Profit Margin
3 2012 Apple     156508  41733  26.66509
6 2012 Google     50175  10737  21.39910
9 2012 Microsoft  73723  16978  23.02945

In [51]:
mean(df[df$Year == 2012, 4])

[1] 23149.33

In [53]:
mean(df[df$Year == 2012, "Profit"])

[1] 23149.33

#### 8* Написати функцію, що знаходить запис з максимальною маржею за усі роки.

In [55]:
df

  Year Company   Revenue Profit Margin
1 2010 Apple      65225  14013  21.48409
4 2010 Google     29321   8505  29.00651
7 2010 Microsoft  62484  18760  30.02369
2 2011 Apple     108249  25922  23.94664
5 2011 Google     37905   9737  25.68790
8 2011 Microsoft  69943  23150  33.09838
3 2012 Apple     156508  41733  26.66509
6 2012 Google     50175  10737  21.39910
9 2012 Microsoft  73723  16978  23.02945

In [70]:
find_max_margin <- function(df_with_margin) {
    max_margin <- max(df_with_margin$Margin)
    df_with_margin[df_with_margin$Margin == max_margin,]
}

In [69]:
find_max_margin(df)

  Year Company   Revenue Profit Margin
8 2011 Microsoft 69943   23150  33.09838

In [66]:
find_min_margin <- function(df_with_margin) {
    min_margin <- min(df_with_margin$Margin)
    df_with_margin[df_with_margin$Margin == min_margin,]
}

In [67]:
find_min_margin(df)

  Year Company Revenue Profit Margin
6 2012 Google  50175   10737  21.3991